app/Controllers/admin/Dashboardctrl.php

SELECT COUNT(*) AS `numrows`
FROM `tb_promo`
WHERE `akhir_promo` >= '2025-06-10'
SELECT COUNT(*) AS `numrows`
FROM `tb_promo`
WHERE `akhir_promo` BETWEEN NOW() AND DATE_ADD(NOW(), INTERVAL 7 DAY)
SELECT COUNT(*) AS `numrows`
FROM `tb_pelatihan`
WHERE `tgl_mulai` <= '2025-06-10'
AND `tgl_akhir` >= '2025-06-10'
SELECT COUNT(*) AS `numrows`
FROM `tb_pelatihan`
WHERE `tgl_mulai` > '2025-06-10'
SELECT COUNT(*) AS `numrows`
FROM `tb_jawaban`
WHERE `status` = 'dikirim'
SELECT `tb_tugas`.*, `tb_pelatihan`.`nama_pelatihan`, COUNT(tb_jawaban.id_jawaban) as jumlah_pengumpulan
FROM `tb_tugas`
JOIN `tb_pelatihan` ON `tb_pelatihan`.`id_pelatihan` = `tb_tugas`.`id_pelatihan`
LEFT JOIN `tb_jawaban` ON `tb_jawaban`.`id_tugas` = `tb_tugas`.`id_tugas` AND `tb_jawaban`.`status` = "dikirim"
GROUP BY `tb_tugas`.`id_tugas`
ORDER BY `tb_tugas`.`id_tugas` DESC
SELECT `tb_pelatihan`.*, `tb_materi`.`nama_materi`, `tb_kota`.`nama_kota`, COUNT(tb_pelatihan_user.id_user) as jumlah_peserta
FROM `tb_pelatihan`
JOIN `tb_materi` ON `tb_materi`.`id_materi` = `tb_pelatihan`.`id_materi`
JOIN `tb_kota` ON `tb_kota`.`id_kota` = `tb_pelatihan`.`id_kota`
LEFT JOIN `tb_pelatihan_user` ON `tb_pelatihan_user`.`id_pelatihan` = `tb_pelatihan`.`id_pelatihan`
WHERE `tb_pelatihan`.`tgl_mulai` >= '2025-06-10'
GROUP BY `tb_pelatihan`.`id_pelatihan`
ORDER BY `tb_pelatihan`.`tgl_mulai` ASC
SELECT *
FROM `tb_promo`
WHERE `akhir_promo` >= '2025-06-10'
AND `akhir_promo` <= '2025-06-17'
ORDER BY `akhir_promo` ASC
---
    public function index()
    {
        // Pengecekan session dan role
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
            return redirect()->to(base_url('login'));
        }

        // Data statistik dasar
        $data = [
            'total_users' => $this->userModel->countAll(),
            'active_promos' => $this->promoModel->where('akhir_promo >=', date('Y-m-d'))->countAllResults(),
            'expiring_soon' => $this->promoModel->where('akhir_promo BETWEEN NOW() AND DATE_ADD(NOW(), INTERVAL 7 DAY)')->countAllResults(),
            'active_trainings' => $this->pelatihanModel->where('tgl_mulai <=', date('Y-m-d'))
                ->where('tgl_akhir >=', date('Y-m-d'))
                ->countAllResults(),
            'upcoming_trainings' => $this->pelatihanModel->where('tgl_mulai >', date('Y-m-d'))
                ->countAllResults(),
            'pending_tasks' => $this->jawabanModel->where('status', 'dikirim')->countAllResults(),

            // Data untuk tabel
            'recent_tasks' => $this->tugasModel->select('tb_tugas.*, tb_pelatihan.nama_pelatihan, COUNT(tb_jawaban.id_jawaban) as jumlah_pengumpulan')
                ->join('tb_pelatihan', 'tb_pelatihan.id_pelatihan = tb_tugas.id_pelatihan')
                ->join('tb_jawaban', 'tb_jawaban.id_tugas = tb_tugas.id_tugas AND tb_jawaban.status = "dikirim"', 'left')
                ->groupBy('tb_tugas.id_tugas')
                ->orderBy('tb_tugas.id_tugas', 'DESC')
                ->limit(5)
                ->findAll(),

            'upcoming_trainings_list' => $this->pelatihanModel->select('tb_pelatihan.*, tb_materi.nama_materi, tb_kota.nama_kota, COUNT(tb_pelatihan_user.id_user) as jumlah_peserta')
                ->join('tb_materi', 'tb_materi.id_materi = tb_pelatihan.id_materi')
                ->join('tb_kota', 'tb_kota.id_kota = tb_pelatihan.id_kota')
                ->join('tb_pelatihan_user', 'tb_pelatihan_user.id_pelatihan = tb_pelatihan.id_pelatihan', 'left')
                ->where('tb_pelatihan.tgl_mulai >=', date('Y-m-d'))
                ->groupBy('tb_pelatihan.id_pelatihan')
                ->orderBy('tb_pelatihan.tgl_mulai', 'ASC')
                ->limit(5)
                ->findAll(),

            'ending_promos' => $this->promoModel->where('akhir_promo >=', date('Y-m-d'))
                ->where('akhir_promo <=', date('Y-m-d', strtotime('+7 days')))
                ->orderBy('akhir_promo', 'ASC')
                ->limit(5)
                ->findAll(),

SELECT COUNT(*) AS `numrows`
FROM `tb_pelatihan_user`
WHERE DATE_FORMAT(tgl_daftar, '%Y-%m') = '2025-01'
---
    private function getTrainingRegistrationData()
    {
        $data = [];
        for ($i = 5; $i >= 0; $i--) {
            $month = date('Y-m', strtotime("-$i months"));
            $data[] = $this->pelatihanUserModel->where("DATE_FORMAT(tgl_daftar, '%Y-%m') =", $month)
                ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_jawaban`
WHERE DATE(waktu_pengumpulan) = '2025-06-04'
---
    private function getTaskSubmissionData()
    {
        $data = [];
        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $data[] = $this->jawabanModel->where('DATE(waktu_pengumpulan)', $date)
                ->countAllResults();