app/Controllers/admin/Tugasctrl.php

    public function index()
    {
        $data = [
            'title' => 'Pilih Pelatihan - Admin',
            'pelatihanList' => $this->pelatihanModel->select('id_pelatihan, nama_pelatihan, tgl_mulai, tgl_akhir')->findAll(),
---
SELECT `id_pelatihan`, `nama_pelatihan`, `tgl_mulai`, `tgl_akhir`
FROM `tb_pelatihan`

    public function tugasByPelatihan($id_pelatihan)
    {
        $pelatihan = $this->pelatihanModel->find($id_pelatihan);

        if (!$pelatihan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Pelatihan tidak ditemukan');
        }

        $tugasList = $this->tugasModel
            ->where('id_pelatihan', $id_pelatihan)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `tb_pelatihan`
WHERE `tb_pelatihan`.`id_pelatihan` = '4'
SELECT *
FROM `tb_tugas`
WHERE `id_pelatihan` = '4'
ORDER BY `created_at` DESC

    public function tambah($id_pelatihan)
    {
        $pelatihan = $this->pelatihanModel->find($id_pelatihan);
        $users = $this->userModel->where('role', 'peserta')->findAll();
---
SELECT *
FROM `tb_pelatihan`
WHERE `tb_pelatihan`.`id_pelatihan` = '4'
SELECT *
FROM `tb_user`
WHERE `role` = 'peserta'

    public function pengumpulan($id_tugas)
    {
        $tugas = $this->tugasModel->find($id_tugas);
        if (!$tugas) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $jawabanModel = new \App\Models\JawabanModel();
        $pengumpulan = $jawabanModel->select('tb_jawaban.id_jawaban, tb_jawaban.*, tb_user.nama_user, tb_jawaban.waktu_pengumpulan as updated_at')
            ->join('tb_user', 'tb_user.id_user = tb_jawaban.id_user')
            ->where('tb_jawaban.id_tugas', $id_tugas)
            ->findAll();
---
SELECT *
FROM `tb_tugas`
WHERE `tb_tugas`.`id_tugas` = '13'
SELECT `tb_jawaban`.`id_jawaban`, `tb_jawaban`.*, `tb_user`.`nama_user`, `tb_jawaban`.`waktu_pengumpulan` as `updated_at`
FROM `tb_jawaban`
JOIN `tb_user` ON `tb_user`.`id_user` = `tb_jawaban`.`id_user`
WHERE `tb_jawaban`.`id_tugas` = '13'

    public function detail_pengumpulan($id_jawaban)
    {
        $jawabanModel = new JawabanModel();

        // Ambil data jawaban beserta relasi tugas dan user
        $jawaban = $jawabanModel->select('tb_jawaban.*, tb_tugas.judul_tugas, tb_tugas.soal, tb_tugas.id_pelatihan, tb_user.nama_user')
            ->join('tb_tugas', 'tb_tugas.id_tugas = tb_jawaban.id_tugas')
            ->join('tb_user', 'tb_user.id_user = tb_jawaban.id_user')
            ->where('tb_jawaban.id_jawaban', $id_jawaban)
            ->first();

        if (!$jawaban) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Data pengumpulan tidak ditemukan');
        }

        // Ambil data pelatihan
        $pelatihan = $this->pelatihanModel->find($jawaban['id_pelatihan']);
---
SELECT `tb_jawaban`.*, `tb_tugas`.`judul_tugas`, `tb_tugas`.`soal`, `tb_tugas`.`id_pelatihan`, `tb_user`.`nama_user`
FROM `tb_jawaban`
JOIN `tb_tugas` ON `tb_tugas`.`id_tugas` = `tb_jawaban`.`id_tugas`
JOIN `tb_user` ON `tb_user`.`id_user` = `tb_jawaban`.`id_user`
WHERE `tb_jawaban`.`id_jawaban` = '2'
 LIMIT 1
SELECT *
FROM `tb_pelatihan`
WHERE `tb_pelatihan`.`id_pelatihan` = '4'

    public function nilai($id_jawaban)
    {
        $jawabanModel = new JawabanModel();
        $jawaban = $jawabanModel->select('tb_jawaban.*, tb_tugas.judul_tugas, tb_tugas.soal, tb_tugas.id_pelatihan, tb_user.nama_user')
            ->join('tb_tugas', 'tb_tugas.id_tugas = tb_jawaban.id_tugas')
            ->join('tb_user', 'tb_user.id_user = tb_jawaban.id_user')
            ->where('tb_jawaban.id_jawaban', $id_jawaban)
            ->first();

        if (!$jawaban) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Data pengumpulan tidak ditemukan');
        }

        // Ambil data pelatihan
        $pelatihan = $this->pelatihanModel->find($jawaban['id_pelatihan']);
---
SELECT `tb_jawaban`.*, `tb_tugas`.`judul_tugas`, `tb_tugas`.`soal`, `tb_tugas`.`id_pelatihan`, `tb_user`.`nama_user`
FROM `tb_jawaban`
JOIN `tb_tugas` ON `tb_tugas`.`id_tugas` = `tb_jawaban`.`id_tugas`
JOIN `tb_user` ON `tb_user`.`id_user` = `tb_jawaban`.`id_user`
WHERE `tb_jawaban`.`id_jawaban` = '2'
 LIMIT 1
SELECT *
FROM `tb_pelatihan`
WHERE `tb_pelatihan`.`id_pelatihan` = '4'