app/Controllers/admin/VoucherController.php

SELECT *
FROM `tb_voucher`
---
    public function index()
    {
        $data = [
            'title' => 'Kelola Voucher',
            'vouchers' => $this->voucherModel->findAll()