app/Models/PelatihanModel.php

SELECT `tb_pelatihan`.*, `tb_materi`.`nama_materi`, `tb_kota`.`nama_kota`, `tb_provinsi`.`nama_provinsi`, `penyelenggara1`.`pihak_penyelenggara` as `penyelenggara_1`, `penyelenggara2`.`pihak_penyelenggara` as `penyelenggara_2`, `penyelenggara3`.`pihak_penyelenggara` as `penyelenggara_3`
FROM `tb_pelatihan`
JOIN `tb_materi` ON `tb_materi`.`id_materi` = `tb_pelatihan`.`id_materi`
JOIN `tb_kota` ON `tb_kota`.`id_kota` = `tb_pelatihan`.`id_kota`
JOIN `tb_provinsi` ON `tb_provinsi`.`id_provinsi` = `tb_kota`.`id_provinsi`
LEFT JOIN `tb_penyelenggara` as `penyelenggara1` ON `penyelenggara1`.`id_penyelenggara` = `tb_pelatihan`.`id_penyelenggara_1`
LEFT JOIN `tb_penyelenggara` as `penyelenggara2` ON `penyelenggara2`.`id_penyelenggara` = `tb_pelatihan`.`id_penyelenggara_2`
LEFT JOIN `tb_penyelenggara` as `penyelenggara3` ON `penyelenggara3`.`id_penyelenggara` = `tb_pelatihan`.`id_penyelenggara_3`
---
    public function getPelatihanWithRelations()
    {
        return $this->select('tb_pelatihan.*,
                            tb_materi.nama_materi,
                            tb_kota.nama_kota,
                            tb_provinsi.nama_provinsi,
                            penyelenggara1.pihak_penyelenggara as penyelenggara_1,
                            penyelenggara2.pihak_penyelenggara as penyelenggara_2,
                            penyelenggara3.pihak_penyelenggara as penyelenggara_3')
            ->join('tb_materi', 'tb_materi.id_materi = tb_pelatihan.id_materi')
            ->join('tb_kota', 'tb_kota.id_kota = tb_pelatihan.id_kota')
            ->join('tb_provinsi', 'tb_provinsi.id_provinsi = tb_kota.id_provinsi')
            ->join('tb_penyelenggara as penyelenggara1', 'penyelenggara1.id_penyelenggara = tb_pelatihan.id_penyelenggara_1', 'left')
            ->join('tb_penyelenggara as penyelenggara2', 'penyelenggara2.id_penyelenggara = tb_pelatihan.id_penyelenggara_2', 'left')
            ->join('tb_penyelenggara as penyelenggara3', 'penyelenggara3.id_penyelenggara = tb_pelatihan.id_penyelenggara_3', 'left')
            ->findAll();